Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེ་དངོས་པོ་ལ་འདི་ནི་བདག་གོ །ཞེས་བྱ་བར་མཐའ་གཉིས་ལ་ཆགས་ཏེ། སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་དང་།
en: If you ask why, it is because in the perception of themselves as an entity they become attached to the two extremes.

source: བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་དང་། བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་སྤོང་བའི་བར་ལ།
en: In the perception of themselves in relation to generosity, ethical discipline, tolerance, perseverance, meditative concentration, wisdom and [the other attributes and goals], up to and including the abandonment of all afflicted mental states associated with reincarnation through the continuity of propensities, they become attached to the two extremes.

source: འདི་ནི་བདག་གོ་ཞེས་བྱ་བར་མཐའ་གཉིས་ལ་ཆགས་པར་གྱུར་པས། གང་མཐའ་གཉིས་ལ་ཆགས་པར་གྱུར་པ་དེ་ལ་ནི་ཐར་པ་མེད་དེ། དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Those who in this manner become attached to the two extremes will not be liberated.

source: རབ་འབྱོར་དངོས་པོའི་འདུ་ཤེས་ཅན་ལ་ནི་སྦྱིན་པ་འང་མེད། ཚུལ་ཁྲིམས་ཀྱང་མེད། བཟོད་པ་འང་མེད། བརྩོན་འགྲུས་ཀྱང་མེད། བསམ་གཏན་ཡང་མེད། ཤེས་རབ་ཀྱང་མེད། བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་སྤང་བའི་བར་དུ་ཡང་། ཡོངས་སུ་ཤེས་པ་མེད་ན། དེ་ཐར་པར་འགྱུར་བ་ལྟ་ག་ལས་ཡོད།
en: If you ask why, Subhūti, if those who have the perception of entities are without generosity, without ethical discipline, without tolerance, without perseverance, without meditative concentration, and without wisdom, and they lack comprehension with respect to [all the attributes and goals], up to and including the abandonment of all afflicted mental states associated with reincarnation through the continuity of propensities, how could they possibly be liberated?” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དངོས་པོ་མཆིས། ཞེས་བགྱི་བ་ནི་ཅི་ལགས།
en: Blessed Lord what are entities?

source: དངོས་པོ་མ་མཆིས་ཞེས་བགྱི་བ་ནི་ཅི་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: What are nonentities?” “

source: རབ་འབྱོར་གཉིས་ནི་དངོས་པོ་ཡོད་པའོ།
en: Subhūti, entities are dualistic.

source: །མི་གཉིས་པ་ནི་དངོས་པོ་མེད་པའོ། །གསོལ་པ།
en: Nonentities are nondualistic,” replied the Blessed One. “

source: བཅོམ་ལྡན་འདས་གཉིས་ཞེས་བགྱི་བ་ཇི་ལྟ་བུ་ལགས།
en: Blessed Lord, with respect to what are entities dualistic?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་གཟུགས་ཀྱི་འདུ་ཤེས་ནི་གཉིས་སོ།
en: Subhūti,” replied the Blessed One, “the perception of physical forms is dualistic.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པའི་འདུ་ཤེས་ནི་གཉིས་སོ།
en: The perception of feelings, perceptions, formative predispositions, and consciousness is dualistic.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་འདུ་ཤེས་ནི་གཉིས་སོ། །བླང་བ་དང་དོར་བའི་འདུ་ཤེས་ནི་གཉིས་སོ། །བསམ་གཏན་དང་པོ་དང་། བསམ་གཏན་གཉིས་པ་དང་། བསམ་གཏན་གསུམ་པ་དང་། བསམ་གཏན་བཞི་པ་དང་། བྱམས་པ་དང་། སྙིང་རྗེ་དང་།
en: The perception of the sense fields, the sensory elements, and the links of dependent origination is dualistic. {

source: དགའ་བ་དང་།
en: Ki.

source: བཏང་སྙོམས་དང་།
en: V: 166} The perception of phenomena to be adopted and phenomena to be forsaken is dualistic.

source: ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་དང་། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པའི་འདུ་ཤེས་ནི་གཉིས་སོ། །སངས་རྒྱས་རྗེས་སུ་དྲན་པ་དང་། ཆོས་རྗེས་སུ་དྲན་པ་དང་། དགེ་འདུན་རྗེས་སུ་དྲན་པ་དང་། ཚུལ་ཁྲིམས་རྗེས་སུ་དྲན་པ་དང་། གཏོང་བ་རྗེས་སུ་དྲན་པ་དང་།
en: The perception of the first meditative concentration, the second meditative concentration, the third meditative concentration, the fourth meditative concentration, loving kindness, compassion, empathetic joy, equanimity, absorption in the sphere of infinite space, absorption in the sphere of infinite consciousness, absorption in the sphere of nothing-at-all, and absorption in the sphere of neither perception nor nonperception is dualistic.

source: ལྷ་རྗེས་སུ་དྲན་པ་དང་། སྐྱོ་བ་རྗེས་སུ་དྲན་པ་དང་། དབུགས་ཕྱི་ནང་དུ་རྒྱུ་བ་རྗེས་སུ་དྲན་པ་དང་། འཆི་བ་རྗེས་སུ་དྲན་པ་དང་། ལུས་ཀྱི་རྣམ་པ་རྗེས་སུ་དྲན་པའི་འདུ་ཤེས་ནི་གཉིས་སོ།
en: The perception of the recollection of the Buddha, the recollection of the Dharma, the recollection of the Saṅgha, the recollection of ethical discipline, the recollection of giving away, the recollection of the god realms, the recollection of disillusionment, the recollection of breathing, the recollection of death, and the recollection of the body are dualistic.

source: །མི་རྟག་པའི་འདུ་ཤེས་དང་། སྡུག་བསྔལ་གྱི་འདུ་ཤེས་དང་། བདག་མེད་པའི་འདུ་ཤེས་དང་། མི་སྡུག་པའི་འདུ་ཤེས་དང་། དངོས་པོ་མེད་པའི་འདུ་ཤེས་དང་། བདག་གི་འདུ་ཤེས་དང་། སེམས་ཅན་གྱི་འདུ་ཤེས་དང་། སྲོག་གི་འདུ་ཤེས་དང་། སྐྱེ་བའི་འདུ་ཤེས་དང་། གསོ་བའི་འདུ་ཤེས་དང་། སྐྱེས་བུའི་འདུ་ཤེས་དང་། གང་ཟག་གི་འདུ་ཤེས་དང་། ཤེད་ཅན་གྱི་འདུ་ཤེས་དང་། ཤེད་བདག་གི་འདུ་ཤེས་དང་། བྱེད་པ་པོའི་འདུ་ཤེས་དང་། ཚོར་བ་པོའི་འདུ་ཤེས་དང་། ཤེས་པ་པོའི་འདུ་ཤེས་དང་།
en: The perception of impermanence, the perception of suffering, the perception of nonself, the perception of unattractiveness, the perception of nonentities, the perception of self, the perception of beings, the perception of life forms, the perception of living beings, the perception of life, the perception of living creatures, the perception of individual personalities, the perception of human beings, the perception of people, the perception of actors, the perception of experiencers, the perception of knowers, and the perception of viewers is dualistic.

source: མཐོང་བ་པོའི་འདུ་ཤེས་ཀྱི་འདུ་ཤེས་ནི་གཉིས་སོ། །རྟག་པའི་འདུ་ཤེས་དང་། བདེ་བའི་འདུ་ཤེས་དང་། སྡུག་པའི་འདུ་ཤེས་དང་། བདག་གི་འདུ་ཤེས་ཀྱི་འདུ་ཤེས་ནི་གཉིས་སོ།
en: The perception of permanence, the perception of happiness, the perception of attractiveness, and the perception of self is dualistic.

source: །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱི་འདུ་ཤེས་ནི་གཉིས་སོ།
en: The perception of the factors conducive to enlightenment is dualistic.

source: །སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུའི་འདུ་ཤེས་ནི་གཉིས་སོ།
en: The perception of the meditative stabilities of emptiness, signlessness, and wishlessness, the eight aspects of liberation, and the nine serial steps of meditative absorption is dualistic.

source: །རྟོག་པ་དང་བཅས་དཔྱོད་པ་དང་བཅས་པའི་ཏིང་ངེ་འཛིན་དང་། རྟོག་པ་མེད་ལ་དཔྱོད་པ་ཙམ་གྱི་ཏིང་ངེ་འཛིན་དང་། རྟོག་པ་མེད་ཅིང་དཔྱོད་པ་མེད་པའི་ཏིང་ངེ་འཛིན་གྱི་འདུ་ཤེས་ནི་གཉིས་སོ། །སྡུག་བསྔལ་འཕགས་པའི་བདེན་པ་དང་། ཀུན་འབྱུང་བ་འཕགས་པའི་བདེན་པ་དང་།
en: The perception of the meditative stability endowed with ideation and scrutiny, the meditative stability devoid of ideation and endowed with some scrutiny, and the meditative stability devoid of both ideation and scrutiny is dualistic.

source: འགོག་པ་འཕགས་པའི་བདེན་པ་དང་། ལམ་འཕགས་པའི་བདེན་པ་དང་། སྡུག་བསྔལ་ཤེས་པ་དང་། ཀུན་འབྱུང་བ་ཤེས་པ་དང་། འགོག་པ་ཤེས་པ་དང་། ལམ་ཤེས་པ་དང་། ཟད་པ་ཤེས་པ་དང་། མི་སྐྱེ་བ་ཤེས་པ་དང་། ཆོས་ཤེས་པ་དང་། རྗེས་སུ་འགྲོ་བ་ཤེས་པ་དང་།
en: The perception of the noble truth of suffering, the noble truth of the origin of suffering, the noble truth of the cessation [of suffering], the noble truth of the path, the knowledge of suffering, the knowledge of the origin of suffering, the knowledge of the cessation of suffering, knowledge of the path, the knowledge of the extinction of contaminants, the knowledge that contaminants will not arise again, the knowledge of phenomena, the knowledge of phenomena that is subsequently realized, the knowledge of the relative, the knowledge that is masterful, and the knowledge that is semantic is dualistic.

source: ཀུན་རྫོབ་ཤེས་པ་དང་། འདྲིས་པ་ཤེས་པ་དང་། སྒྲ་ཇི་བཞིན་ཤེས་པའི་འདུ་ཤེས་ནི་གཉིས་སོ། །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་ཀྱི་འདུ་ཤེས་ནི་གཉིས་སོ། །མངོན་པར་ཤེས་པ་དྲུག་དང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་། གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་དང་།
en: The perception of all the perfections and all the aspects of emptiness is dualistic.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོའི་འདུ་ཤེས་ནི་གཉིས་སོ། །རྒྱུན་དུ་ཞུགས་པ་དང་།
en: The perception of the six extrasensory powers, all the meditative stabilities, all the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, the eighteen distinct qualities of the buddhas, great loving kindness, and great compassion is dualistic.

source: ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་དང་། རང་སངས་རྒྱས་དང་། སངས་རྒྱས་ཀྱི་འདུ་ཤེས་ནི་གཉིས་སོ།
en: The perception of entering the stream to nirvāṇa, being destined for only one more rebirth, no longer being subject to rebirth, arhatship, individual enlightenment, and buddhahood is dualistic.

source: །འདུས་བྱས་ཀྱི་ཁམས་ཀྱི་འདུ་ཤེས་དང་། འདུས་མ་བྱས་ཀྱི་ཁམས་ཀྱི་འདུ་ཤེས་ནི་གཉིས་སོ།
en: The perception of conditioned elements and the perception of unconditioned elements are dualistic.

source: །རབ་འབྱོར་དེ་ལྟར་དེ་སྙེད་དུ་འདུ་ཤེས་དང་བཅས་པ་ཐམས་ཅད་དང་། དེ་སྙེད་དུ་འདུ་ཤེས་མེད་པ་དེ་དག་ཐམས་ཅད་ནི་གཉིས་ཏེ།
en: Subhūti, all those phenomena that are imbued with perception are dualistic and all those phenomena that are devoid of perception are dualistic.

source: ཇི་ཙམ་དུ་གཉིས་པ་དེ་ཙམ་དུ་དངོས་པོའོ།
en: To the extent that phenomena are dualistic, there are entities.

source: །ཇི་ཙམ་དུ་དངོས་པོ་ཡོད་པ་དེ་ཙམ་དུ་འཁོར་བའོ། །ཇི་ཙམ་དུ་འཁོར་བ་དེ་ཙམ་དུ་སེམས་ཅན་རྣམས་སྐྱེ་བ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་།
en: To the extent that there are entities, there is cyclic existence.

source: མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་ལས་ཡོངས་སུ་མི་འགྲོལ་ལོ།
en: To the extent that there is cyclic existence, beings are not liberated from birth, aging, ill health, death, sorrow, lamentation, suffering, discomfort, and agitation. “

source: །འདུ་ཤེས་ཐམས་ཅད་ཡིད་ལ་མི་བྱེད་པ་ནི་གཉིས་སུ་མེད་པ་སྟེ།
en: Nonattention to all these perceptions is nondualistic.

source: རབ་འབྱོར་རྣམ་གྲངས་དེས་ཀྱང་འདི་ལྟར་གཉིས་ཀྱི་འདུ་ཤེས་ཅན་ལ་སྦྱིན་པ་མེད་པ་དང་། ཚུལ་ཁྲིམས་མེད་པ་དང་། བཟོད་པ་མེད་པ་དང་། བརྩོན་འགྲུས་མེད་པ་དང་། བསམ་གཏན་མེད་པ་དང་། ཤེས་རབ་མེད་པ་དང་།
en: It is for this reason also, Subhūti, that one should know that those with dualistic perception are without generosity, without ethical discipline, without tolerance, without perseverance, without meditative concentration, without wisdom, without the path, without attainment, and without clear realization. “

source: ལམ་མེད་པ་དང་། ཐོབ་པ་མེད་པ་དང་། མངོན་པར་རྟོགས་པ་མེད་པར་རིག་པར་བྱའོ། །རབ་འབྱོར་གཉིས་ཀྱི་འདུ་ཤེས་ཅན་ལ་ནི་ཆུང་ངུ་ན་འཐུན་པའི་བཟོད་པ་ཡང་མེད་ན། གཟུགས་ཡོངས་སུ་ཤེས་པར་འགྱུར་བ་ལྟ་ག་ལ་ཡོད།
en: Subhūti, if those with dualistic perception do not have even a little of the appropriate receptivity, how could they possibly comprehend physical forms?

source: ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ཡོངས་སུ་ཤེས་པར་འགྱུར་བ་ལྟ་ག་ལ་ཡོད།
en: How could they comprehend feelings, perceptions, formative predispositions, and consciousness?

source: སྐྱེ་མཆེད་དང་། ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཡོངས་སུ་ཤེས་པར་འགྱུར་བ་ལྟ་ག་ལ་ཡོད།
en: How could they comprehend the sense fields, the sensory elements, and the links of dependent origination?

source: བླང་བ་དང་དོར་བ་ཡོངས་སུ་ཤེས་པར་འགྱུར་བ་ལྟ་ག་ལ་ཡོད། བསམ་གཏན་དང་པོ་དང་། བསམ་གཏན་གཉིས་པ་དང་།
en: How could they comprehend phenomena to be adopted and phenomena to be forsaken?

source: བསམ་གཏན་གསུམ་པ་དང་། བསམ་གཏན་བཞི་པ་དང་། བྱམས་པ་དང་། སྙིང་རྗེ་དང་། དགའ་བ་དང་བཏང་སྙོམས་དང་། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མ
en: How could they comprehend the first meditative concentration, the second meditative concentration, the third meditative concentration, the fourth meditative concentration, loving kindness, compassion, empathetic joy, equanimity, absorption in the sphere of infinite space, absorption in the sphere of infinite consciousness, absorption in the sphere of nothing-at-all, and absorption in the sphere of neither perception nor nonperception?

source: ཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་དང་། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ཡོངས་སུ་ཤེས་པར་འགྱུར་བ་ལྟ་ག་ལ་ཡོད། སངས་རྒྱས་རྗེས་སུ་དྲན་པ་དང་། ཆོས་རྗེས་སུ་དྲན་པ་དང་། དགེ་འདུན་རྗེས་སུ་དྲན་པ་དང་། ཚུལ་ཁྲིམས་རྗེས་སུ་དྲན་པ་དང་། གཏོང་བ་རྗེས་སུ་དྲན་པ་དང་། ལྷ་རྗེས་སུ་དྲན་པ་དང་། སྐྱོ་བ་རྗེས་སུ་དྲན་པ་དང་། དབུགས་ཕྱི་ནང་དུ་རྒྱུ་བ་རྗེས་སུ་དྲན་པ་དང་། འཆི་བ་རྗེས་སུ་དྲན་པ་དང་།
en: How could they comprehend the recollection of the Buddha, the recollection of the Dharma, the recollection of the Saṅgha, the recollection of ethical discipline, the recollection of giving away, the recollection of the god realms, the recollection of disillusionment, the recollection of breathing, the recollection of death, and the recollection of the body?

source: ལུས་ཀྱི་རྣམ་པ་རྗེས་སུ་དྲན་པ་ཡོངས་སུ་ཤེས་པར་འགྱུར་བ་ལྟ་ག་ལ་ཡོད། མི་རྟག་པའི་འདུ་ཤེས་དང་། སྡུག་བསྔལ་གྱི་འདུ་ཤེས་དང་། བདག་མེད་པའི་འདུ་ཤེས་དང་། མི་སྡུག་པའི་འདུ་ཤེས་དང་། དངོས་པོ་མེད་པའི་འདུ་ཤེས་དང་། བདག་གི་འདུ་ཤེས་དང་། སེམས་ཅན་གྱི་འདུ་ཤེས་དང་། སྲོག་གི་འདུ་ཤེས་དང་། སྐྱེ་བའི་འདུ་ཤེས་དང་། གསོ་བའི་འདུ་ཤེས་དང་། སྐྱེས་བུའི་འདུ་ཤེས་དང་། གང་ཟག་གི་འདུ་ཤེས་དང་། ཤེད་ཅན་གྱི་འདུ་ཤེས་དང་། ཤེད་བདག་གི་འདུ་ཤེས་དང་། བྱེད་པ་པོའི་འདུ་ཤེས་དང་། ཚོར་བ་པོའི་འདུ་ཤེས་དང་། ཤེས་པ་པོའི་འདུ་ཤེས་དང་།
en: How could they comprehend the perception of impermanence, the perception of suffering, the perception of nonself, the perception of unattractiveness, the perception of nonentities, the perception of self, the perception of beings, the perception of life forms, the perception of living beings, the perception of life, the perception of living creatures, the perception of individual personalities, the perception of human beings, the perception of people, the perception of actors, the perception of experiencers, the perception of knowers, and the perception of viewers?

source: མཐོང་བ་པོའི་འདུ་ཤེས་ཡོངས་སུ་ཤེས་པར་འགྱུར་བ་ལྟ་ག་ལ་ཡོད། རྟག་པའི་འདུ་ཤེས་དང་། བདེ་བའི་འདུ་ཤེས་དང་། སྡུག་པའི་འདུ་ཤེས་དང་། བདག་གི་འདུ་ཤེས་ཡོངས་སུ་ཤེས་པར་འགྱུར་བ་ལྟ་ག་ལ་ཡོད།
en: How could they comprehend the perception of permanence, the perception of happiness, the perception of attractiveness, and the perception of self?

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཡོངས་སུ་ཤེས་པར་འགྱུར་བ་ལྟ་ག་ལ་ཡོད།
en: How could they comprehend the factors conducive to enlightenment?

source: སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ཡོངས་སུ་ཤེས་པར་འགྱུར་བ་ལྟ་ག་ལ་ཡོད།
en: How could they comprehend the meditative stabilities of emptiness, signlessness, and wishlessness, the eight aspects of liberation, and the nine serial steps of meditative absorption?

source: རྟོག་པ་དང་བཅས་དཔྱོད་པ་དང་བཅས་པའི་ཏིང་ངེ་འཛིན་དང་། རྟོག་པ་མེད་པ་ལ་དཔྱོད་པ་ཙམ་གྱི་ཏིང་ངེ་འཛིན་དང་། རྟོག་པ་མེད་ཅིང་དཔྱོད་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ཡོངས་སུ་ཤེས་པར་འགྱུར་བ་ལྟ་ག་ལ་ཡོད། སྡུག་བསྔལ་འཕགས་པའི་བདེན་པ་དང་། ཀུན་འབྱུང་བ་འཕགས་པའི་བདེན་པ་དང་།
en: How could they comprehend the meditative stability endowed with ideation and scrutiny, the meditative stability devoid of ideation and endowed with some scrutiny, and the meditative stability devoid of both ideation and scrutiny?

source: ཀུན་རྫོབ་ཤེས་པ་དང་། འདྲིས་པ་ཤེས་པ་དང་། སྒྲ་ཇི་བཞིན་ཤེས་པ་ཡོངས་སུ་ཤེས་པར་འགྱུར་བ་ལྟ་ག་ལ་ཡོད། ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་ཡོངས་སུ་ཤེས་པར་འགྱུར་བ་ལྟ་ག་ལ་ཡོད།
en: How could they comprehend all the perfections and all the aspects of emptiness?

source: མངོན་པར་ཤེས་པ་དྲུག་དང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་། གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་ཡོངས་སུ་ཤེས་པར་འགྱུར་བ་ལྟ་ག་ལ་ཡོད། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དང་།
en: How could they comprehend the six extrasensory powers, all the meditative stabilities, all the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, the distinct qualities of the buddhas, great loving kindness, and great compassion?

source: ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་ཤེས་པར་འགྱུར་བ་ལྟ་ག་ལ་ཡོད།
en: How could they comprehend the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, individual enlightenment, and [the goals], up to and including all-aspect omniscience? “

source: གང་ལ་ལམ་བསྒོམ་པ་མེད་པ་དེ་ལ་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཡང་ག་ལ་ཡོད།
en: How could those who have not cultivated the path have the fruit of entering the stream to nirvāṇa?

source: ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ཡང་ག་ལ་ཡོད།
en: How could they have the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, individual enlightenment, or [the goals], up to and including all-aspect omniscience?

source: བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་པ་ལྟ་ཡང་ག་ལ་ཡོད།
en: How could they have the abandonment of all afflicted mental states associated with reincarnation through the continuity of propensities?”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས་ལེའུ་ལྔ་བཅུ་བརྒྱད་པའོ།། །།དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: This completes the fifty-eighth chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་དེ་ལྟར་དངོས་པོའི་འདུ་ཤེས་ཅན་ལ། འཐུན་པའི་བཟོད་པ་ཡང་མ་མཆིས་པས། ཐོབ་པ་ལྟ་ག་ལ་མཆིས་ཏེ་མ་མཆིས། མངོན་པར་རྟོགས་པ་ལྟ་ཡང་ག་ལ་མཆིས་ཏེ་མ་མཆིས་ན་ཅི་ལགས། བཅོམ་ལྡན་འདས་དངོས་པོ་མ་མཆིས་པའི་འདུ་ཤེས་ཅན་ལ། འཐུན་པའི་བཟོད་པ་འམ། དཀར་པོ་རྣམ་པར་མཐོང་བའི་ས་འམ། རིགས་ཀྱི་སའམ། བརྒྱད་པའི་ས་འམ། མཐོང་བའི་ས་འམ། བསྲབས་པའི་ས་འམ། འདོད་ཆགས་དང་བྲལ་བའི་ས་འམ། བྱས་པ་རྟོགས་པའི་ས་འམ། རང་སངས་རྒྱས་ཀྱི་ས་འམ། བྱང་ཆུབ་སེམས་དཔའི་ས་འམ། སངས་རྒྱས་ཀྱི་ས་འམ། ལམ་བསྒོམ་པ་གང་ལ་བརྟེན་ཅིང་། ཉོན་མོངས་པ་གང་གིས་བསྒྲིབས་པས། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མ་མཆིས་པར་ཆུད་པར་མི་འགྱུར་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མ་མཆིས་པར་མ་ཆུད་པས།
en: Chapter 59 Then the venerable Subhūti asked the Blessed One, “Blessed Lord, if those with perception of entities lack even the appropriate receptivity, and cannot possibly have attainment, and cannot possibly have clear realization, in that case, Blessed Lord, do those with the perception of nonentities possess compatible receptivity, {Ki.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་མི་འགྱུར་བ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མ་ཐོབ་པས། བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་མི་སྤོངས་པའི་སྒྲིབ་པ། ཉན་ཐོས་དང་ལྡན་པ་འམ། རང་སངས་རྒྱས་དང་ལྡན་པའི་ཉོན་མོངས་པ་དེ་དག་སྤོང་བར་འགྱུར་བའི་ལམ་མཆིས་སམ།
en: V: 167} or the level of bright insight, the level of the spiritual family, the eighth-lowest level, the level of insight, the level of attenuated refinement, the level of no attachment, the level of [an arhat’s] spiritual achievement, the level of the pratyekabuddhas, the level of the bodhisattvas, the level of the buddhas, or a path dependent on which they could abandon the afflicted mental states that śrāvakas and pratyekabuddhas have, and obscured by which they do not enter a bodhisattva’s full maturity, and do not attain all-aspect omniscience because they have not entered into the maturity of the bodhisattvas, and are obscured without abandoning all the afflicted mental states associated with reincarnation through the continuity of propensities since they have not attained all-aspect omniscience?

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་སྐྱེ་བར་འགྱུར་བ་གང་ཡང་སྐྱེ་བ་མ་མཆིས་ན། ཇི་ལྟར་ཆོས་དེ་དག་མ་བསྐྱེད་པར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, if there is no arising at all of any attributes that might arise, how could they attain all-aspect omniscience without developing those attributes?” “

source: དངོས་པོ་མེད་པའི་འདུ་ཤེས་ཅན་ལ་འཐུན་པའི་བཟོད་པ་མེད་དོ།
en: Those with the perception of nonentities are without the appropriate receptivity.

source: །མངོན་པར་རྟོགས་པའི་ས་མེད་དོ།
en: They are without the level of clear realization.

source: །དཀར་པོ་རྣམ་པར་མཐོང་བའི་ས་མེད་དོ།
en: They are without the level of bright insight.

source: །རིགས་ཀྱི་ས་མེད་དོ།
en: They are without the level of the spiritual family.

source: །བརྒྱད་པའི་ས་མེད་དོ།
en: They are without the eighth-lowest level.

source: །མཐོང་བའི་ས་མེད་དོ།
en: They are without the level of insight.

source: །བསྲབས་པའི་ས་མེད་དོ།
en: They are without the level of attenuated refinement.

source: །འདོད་ཆགས་དང་བྲལ་བའི་ས་མེད་དོ།
en: They are without the level of no attachment.

source: །བྱས་པ་རྟོགས་པའི་ས་མེད་དོ།
en: They are without the level of [an arhat’s] spiritual achievement.

source: །རང་སངས་རྒྱས་ཀྱི་ས་མེད་དོ།
en: They are without the level of the pratyekabuddhas.

source: །བྱང་ཆུབ་སེམས་དཔའི་ས་མེད་དོ། །སངས་རྒྱས་ཀྱི་ས་མེད་དོ། །ལམ་བསྒོམ་པ་གང་ལ་བརྟེན་ཅིང་ཉོན་མོངས་པ་གང་གིས་བསྒྲིབས་པས། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་ཆུད་པར་མི་འགྱུར་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་མ་ཆུད་པས།
en: They are without the level of the bodhisattvas.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་མི་འགྱུར་བ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མ་ཐོབ་པས། བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་མི་སྤོངས་པའི་སྒྲིབ་པ། ཉན་ཐོས་དང་ལྡན་པ་འམ། རང་སངས་རྒྱས་དང་ལྡན་པའི་ཉོན་མོངས་པ་དེ་དག་སྤོང་བར་འགྱུར་བའི་ལམ་མེད་དོ།
en: They are without the level of the buddhas, and they are without a path dependent on which they could abandon the afflicted mental states that śrāvakas and pratyekabuddhas have, and obscured by which they do not enter a bodhisattva’s full maturity, and do not attain all-aspect omniscience because they have not entered into the maturity of the bodhisattvas, and are obscured, not abandoning all the afflicted mental states associated with reincarnation through the continuity of propensities since they have not attained all-aspect omniscience.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཅི་ལགས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། དངོས་པོ་མཆིས་པར་འདུ་ཤེས་པ་དང་དངོས་པོ་མ་མཆིས་པར་འདུ་ཤེས་པ་མཆིས་སམ།
en: Blessed Lord, when bodhisattva great beings practice the perfection of wisdom, do they have the perception of entities or do they have the perception of nonentities?

source: གཟུགས་སུ་འདུ་ཤེས་པ་དང་།
en: Do they have the perception of physical forms?

source: ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པར་འདུ་ཤེས་པ་དང་།
en: Do they have the perception of feelings, perceptions, formative predispositions, and consciousness?

source: སྐྱེ་མཆེད་དང་ཁམས་སུ་འདུ་ཤེས་པ་དང་། འདོད་ཆགས་སུ་འདུ་ཤེས་པ་དང་།
en: Do they have the perception of the sense fields, the sensory elements, and the links of dependent origination?

source: འདོད་ཆགས་སྤང་བར་འདུ་ཤེས་པ་དང་། ཞེ་སྡང་དུ་འདུ་ཤེས་པ་དང་། ཞེ་སྡང་སྤང་བར་འདུ་ཤེས་པ་དང་། གཏི་མུག་ཏུ་འདུ་ཤེས་པ་དང་། གཏི་མུག་སྤང་བར་འདུ་ཤེས་པ་དང་། མ་རིག་པར་འདུ་ཤེས་པ་དང་། མ་རིག་པ་སྤང་བར་འདུ་ཤེས་པ་དང་། འདུ་བྱེད་དུ་འདུ་ཤེས་པ་དང་། འདུ་བྱེད་སྤང་བར་འདུ་ཤེས་པ་དང་།
en: Do they have the perception of desire, the perception of abandoning desire, the perception of hatred, the perception of abandoning hatred, the perception of delusion, and the perception of abandoning delusion? “

source: རྣམ་པར་ཤེས་པར་འདུ་ཤེས་པ་དང་། རྣམ་པར་ཤེས་པ་སྤང་བར་འདུ་ཤེས་པ་དང་། མིང་དང་གཟུགས་སུ་འདུ་ཤེས་པ་དང་། མིང་དང་གཟུགས་སྤང་བར་འདུ་ཤེས་པ་དང་། སྐྱེ་མཆེད་དྲུག་དུ་འདུ་ཤེས་པ་དང་།
en: Do they have the perception of ignorance, the perception of abandoning ignorance, the perception of formative predispositions, the perception of abandoning formative predispositions, the perception of consciousness, the perception of abandoning consciousness, the perception of name and form, the perception of abandoning name and form, the perception of the six sense fields, the perception of abandoning the six sense fields, the perception of sensory contact, the perception of abandoning sensory contact, the perception of sensation, the perception of abandoning sensation, {Ki.
